---
kind: property
id: P:Autodesk.Revit.DB.Category.Parent
source: html/98caefd8-9d6a-a6f4-7570-f09a7d115276.htm
---
# Autodesk.Revit.DB.Category.Parent Property

Returns the parent category of this category.

## Syntax (C#)
```csharp
public Category Parent { get; }
```

## Returns
Nothing nullptr a null reference ( Nothing in Visual Basic) if this category a not a subcategory